#include <stdio.h>

int main() {
    double x;
    printf("연봉 입력 : ");
    scanf("%lf", &x);
    printf("\t입력한 연봉 : %lf\n", x);

    if (x <= 10000000) {
        printf("\t세금  9% 적용 : %.lf\n", x * 0.09);
        printf("\t전체 세금은   : %.lf입니다.\n", x * 0.09);
    }
    if (x > 10000000 && x <= 40000000) {
        printf("\t세금 18% 적용 : %.lf\n", (x - 10000000) * 0.18);
        printf("\t세금  9% 적용 : %.lf\n", 10000000 * 0.09);
        printf("\t전체 세금은   : %.lf입니다.\n", (x - 10000000) * 0.18 + 10000000 * 0.09);
    }
    if (x > 40000000 && x <= 80000000) {
        printf("\t세금 27% 적용 : %.lf\n", (x - 40000000) * 0.27);
        printf("\t세금 18% 적용 : %.lf\n", 30000000 * 0.18);
        printf("\t세금  9% 적용 : %.lf\n", 10000000 * 0.09);
        printf("\t전체 세금은   : %.lf입니다.\n", (x - 40000000) * 0.27 + (x - 10000000) * 0.18 + 10000000 * 0.09);
    }
    if (x >= 80000000) {
        printf("\t세금 36% 적용 : %.lf\n", (x - 80000000) * 0.36);
        printf("\t세금 27% 적용 : %.lf\n", 40000000 * 0.27);
        printf("\t세금 18% 적용 : %.lf\n", 30000000 * 0.18);
        printf("\t세금  9% 적용 : %.lf\n", 10000000 * 0.09);
        printf("\t전체 세금은   : %.lf입니다.\n", (x - 80000000) * 0.36 + 40000000 * 0.27 + 30000000 * 0.18 + 10000000 * 0.09);
    }

    return 0;
}