#include <stdio.h>
#include <string.h>

typedef struct {
    char name[50];
    char student_num[20];
    char unit[4];
    char major[100];
    char course[100];
    char phone_number[20];
    char adress[50];
    char professor[50];
}student;

int main() {
    student st[10] = {
        {"김영국", "9952203", "4.2", "전자상거래", "공무원", "011-4567-9834", "서울시 도곡동", "최윤호"},
        {"강미연", "9952123", "3.5", "전자상거래", "회사원", "011-4567-9834", "서울시 도화동", "홍길동"},
        {"송은혜", "9952108", "3.2", "전자상거래", "회사원", "011-4567-9834", "서울시 고척동", "박종학"},
        {"박보현", "9952115", "3.0", "전자상거래", "프로게이머","011-4567-9834", "서울시 미곡동", "이종석"},
        {"김미경", "0052028", "4.1", "전자상거래", "웹마스터","011-4567-9834", "서울시 화곡동", "신용헌"},
        {"김형근", "0052029", "4.2", "전자상거래", "웹디자너","011-4567-9834", "서울시 대치동", "박종학"},
        {"배태준", "0052030", "4.3", "전자상거래", "군 인","011-4567-9834", "서울시 마장동", "홍길동"},
        {"김보름", "0052031", "4.3", "전자상거래", "웹디자너","011-4567-9834", "서울시 부평동", "최윤호"},
        {"서정순", "0052032", "3.5", "전자상거래", "웹마스터","011-4567-9834", "서울시 도곡동", "이종석"},
        {"최종욱", "0052033", "3.7", "전자상거래", "DB관리자","011-4567-9834", "서울시 도곡동", "박종학"}
    };

    printf("\t    이 름\t 전 화 번 호      주 소\t\t학 번\t   평점       학 과\t\t진 로\t\t지도교수\n\n");
    for (int i = 0; i < 10; i++) {
        printf("%20s%20s%20s%10s%10s%20s%20s%20s\n", st[i].name,st[i].phone_number,st[i].adress, st[i].student_num,st[i].unit, st[i].major, st[i].course,st[i].professor);
    }
}