#include <stdio.h>
#include <string.h>

typedef struct {
    char name[50];
    char student_num[20];
    char unit[4];
    char major[100];
    char course[100];
}student;

int main() {
    student st[10] = {
        {"김영국", "9952203", "4.2", "전자상거래", "공무원"},
        {"강미연", "9952123", "3.5", "전자상거래", "회사원"},
        {"송은혜", "9952108", "3.2", "전자상거래", "회사원"},
        {"박보현", "9952115", "3.0", "전자상거래", "프로게이머"},
        {"김미경", "0052028", "4.1", "전자상거래", "웹마스터"},
        {"김형근", "0052029", "4.2", "전자상거래", "웹디자너"},
        {"배태준", "0052030", "4.3", "전자상거래", "군 인"},
        {"김보름", "0052031", "4.3", "전자상거래", "웹디자너"},
        {"서정순", "0052032", "3.5", "전자상거래", "웹마스터"},
        {"최종욱", "0052033", "3.7", "전자상거래", "DB관리자"}
    };

    printf("\t    이 름\t\t학 번\t    학점      학 과\t\t진 로\n\n");
    for (int i = 0; i < 10; i++) {
        printf("%20s%20s%10s%20s%20s\n", st[i].name,st[i].student_num,st[i].unit, st[i].major, st[i].course);
    }
}